---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SKPImportOptions Constructor
SKPImportOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SKPImportOptions()()()() | Constructs a new instance of SKPImportOptions with default values of all properties. |
|  | SKPImportOptions(SKPImportOptions) | Constructs a new instance of SKPImportOptions as a copy of the import options. |

# See Also

SKPImportOptions Class

SKPImportOptions Members

Autodesk.Revit.DB Namespace